# Now You Code 1: Data Analysis of Movie Goers

In this assignment you will perform a data analysis of people who go to the movies. 

A movie theatre chain asked movie goers to fill out a quick survey in exchange for a 1/2 price ticket. The survey asked for basic demographics: age, gender, occupation and zip code. This survey results are contained in the data file `'NYC1-moviegoers.csv'`

In this assignment you will write a series of Python pandas code (in several cells) to answer some basic questions about the responses in the dataset.

In [2]:
# this turns off warning messages
import warnings
warnings.filterwarnings('ignore')

### Part 1: Load the dataset

write code to import pandas and load the dataset (in csv format) into the variable `moviegoers` and then print a random sample of 5 people from the data set.

In [36]:
import pandas as pd
moviegoers = pd.read_csv('NYC1-moviegoers.csv')
moviegoers.sample(5)

     user_id  age gender     occupation zip_code
86        87   47      M  administrator    89503
150      151   38      F  administrator    48103
447      448   23      M  entertainment    10021
500      501   22      M        student    10025
322      323   21      M        student    19149

### Part 2: Gender distribution 

How many males and females filled out our data set? 

Write a single line of Python Pandas code to count the genders in the data set. (There should be M = 670, F = 273)

**HINT:** Select the `gender` column then use a built-in series method to count the values in the series.

In [28]:
moviegoers['gender'].value_counts()

M    670
F    273
Name: gender, dtype: int64

### Part 3: People without jobs

Who are the survey respondents without jobs? 
1. moviegoers who occupation = 'none'
Write Python Pandas code to create a variable `no_occupation` which filters the `moviegoers` data set to only those survey respondents with an ocupation of `'none'`.  (There should be 9 people)

In [44]:
no_occupation = moviegoers[moviegoers.occupation == 'none']
no_occupation

     user_id  age gender occupation zip_code
56        57   16      M       none    84010
126      127   33      M       none    73439
129      130   20      M       none    60115
255      256   35      F       none    39042
288      289   11      M       none    94619
417      418   55      F       none    21206
627      628   13      M       none    94306
656      657   26      F       none    78704
755      756   30      F       none    90247

### Part 4: Gender distribution of people without jobs.

What is the gender distribution of the 9 respondents without jobs? 

Write Python Pandas code to display this. 

**HINT:** Use the variable `no_occupation` from the previous step.

In [39]:
no_occupation['gender'].value_counts()

M    5
F    4
Name: gender, dtype: int64

### Part 5: Young Artists

Write Python Pandas code to display the count of respondents with an occupation of artist who are 21 and under. (There should be 5)

**HINT:** You can either set each Pandas filter to a new `DataFrame` variable or try to chain the filters together. Also display them before you try and count them.

In [48]:
artist_under21 = moviegoers[(moviegoers.occupation == 'artist') & (moviegoers.age <= 21)]
artist_under21

     user_id  age gender occupation zip_code
23        24   21      F     artist    94533
149      150   20      F     artist     2139
595      596   20      M     artist    77073
600      601   19      F     artist    99687
781      782   21      F     artist    33205

### Part 6: Distribution by age group

The movie theater which conducted this survey prices their tickets by age group:

 - Youth (age 18 and under) $7.50 
 
 - Adult (age 19 55) $12.50 
 
 - Senior (age 56 and up) $8.50 

Write python code to count the number of moviegoers in each of these age groups.

Your counts should be as follows:
```
Adult     837
Youth      54
Senior     52
```

**HINT:** You must perform feature engineering. Create a new column `'age_group'` and use the `'age'` column to assign one or more values to the age group. After you create the column and set the values get a count of values for the `'age_group'` column.

In [49]:
moviegoers['age_group'] = np.nan
moviegoers['age_group'][moviegoers['age'] <= 18] = 'Youth'
moviegoers['age_group'][moviegoers['age'] >= 19] = 'Adult'
moviegoers['age_group'][moviegoers['age'] >= 56] = 'Senior'

In [50]:
moviegoers['age_group'].value_counts()

Adult     837
Youth      54
Senior     52
Name: age_group, dtype: int64